package anstjgp_0204;

public class Ex_0207 {

	public static void main(String[] args) {
		
		// 제어문 : 조건문, 반복문
		
		/*
		 * 조건문 : 특정한 조건을 만족하면 수행할 작업과 만족하지 않을 때 수행할 작업을 미리 정해놓고,
		 *        조건에 따라 각각 다르게 실행하도록 만들어 놓은 구문
		 * - if문 : 가장 기본적인 조건문으로 조건식 부분과 실행 부분으로 나누어져 있음
		 *       if(조건식){
		 *            시행문장1;
		 *            시행문장2;
		 *       }
		 * - if~else문 : if문의 조건식이 false일 경우 실행되는 문장이 추가된 구문
		 *       if(조건식){
		 *            수행문
		 *       }else{
		 *            수행문
		 *       }
		 * - if~else if~else if else : 조건이 여러가지일 경우 조건에 따라 각각 다른 작업을
		 *                             수행하고 싶을 때 사용
		 *       if(조건식){
		 *            수행문1
		 *       }else if(조건식2){
		 *            수행문2
		 *       }else if(조건식3){
		 *            수행문3
		 *       }else{
		 *            수행문4
		 *       }
		 * 
		 * 조건문과 조건 연산자 : 간단한 if-else문은 삼항연산자로 구현 가능
		 * 
		 * - 중첩 if문 : if문 내에 if문이 있는 문장
		 *       if(조건식){
		 *       
		 *            if(조건식2){
		 *            
		 *       }else{
		 *       
		 *       }
		 *       }
		 *       
		 * - switch-case : 하나의 조건식으로 많은 경우의 수를 처리하는 조건문
		 *                 조건식의 결과가 정수 또는 문자열의 값이고 그 값에 따라 수행문이 결정
		 *              switch(조건식){
		 *                   case 값1:
		 *                       실행문;
		 *                      break;
		 *                   case 값2:
		 *                       실행문;
		 *                      break;
		 *                   case 값3:
		 *                       실행문;
		 *                      break;
		 *                   default:
		 *                      break;
		 *              }
		 * - case문에 문자열 사용하기 : jdk 1.7부터 사용가능             
		 *  
		 */

	}

}


