package anstjgp_0204;

public class Ex_0210 {

	public static void main(String[] args) {
		
		/* 객체지향 프로그래밍(Object-oriented Programming)
		 * : 현실에 존재하는 사물과 개념을 소프트웨어적으로 구현하고, 그 구현된 객체들이
		 *   서로 상호작용하여 데이터를 처리하는 방식
		 * : 코드의 재사용성이 높다
		 * : 신뢰성이 높은 프로그래밍을 가능하게 한다
		 * : 코드관리가 용이하다
		 * 
		 *  - 클래스 : 객체의 속성과 기능 등을 정의한 설계도 ex) 붕어빵 틀
		 *   > 인스턴스 변수 : 객체마다 가지는 고유한 변수
		 *   > 클래스 변수 : 모든 인스턴스가 공통된 값을 공유하는 변수
		 *   > 메서드 : 특정한 작업이나 논리를 구성하는 코드를 괄호로 묶어 놓은 것
		 *  - 인스턴스 : 클래스를 메모리에 생성한 것 ex) 붕어빵
		 *  - 인스턴스의 생성과 사용
		 *     클레스명 변수명; > 클래스의 객체를 참조하기 위한 참조 변수
		 *     변수명 = new 클래스명(); > 클래스의 객체를 생성 후, 객체의 주소를 참조변수에 저장
		 *     
		 *  - 인스턴스 변수 : 객체마다 가지는 고유한 변수
		 *              : 인스턴스를 생성할 때 만들어지면 인스턴스마다 고유의 저장공간을 가지므로
		 *                각기 다른 값을 가질 수 있음
		 *  - 클래스 변수 : 모든 인스턴스가 공통된 값을 공유하는 변수
		 *               즉, 모든 인스턴스가 똑같은 저장 공간을 공유한다
		 */
	}

}















